## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           RESOURCE                            |
|--------|---------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.superset_docs_errors`       |
|        | `aws_cloudwatch_metric_alarm.superset_docs_errors`            |
|        | `aws_cloudwatch_metric_alarm.superset_docs_health_check`      |
|        | `aws_cloudwatch_metric_alarm.superset_docs_invocation_errors` |
|        | `aws_cloudwatch_query_definition.superset_ecs_errors`         |
| update | `aws_cloudfront_distribution.superset_docs`                   |
| delete | `aws_ecr_lifecycle_policy.superset_docs`                      |
|        | `aws_wafv2_web_acl.superset_docs`                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudfront_distribution.superset_docs will be updated in-place
  ~ resource "aws_cloudfront_distribution" "superset_docs" {
        id                              = "EEC9BUT3BBF9O"
        tags                            = {
            "CostCentre" = "cds-superset-docs-staging"
            "Terraform"  = "true"
        }
      - web_acl_id                      = "arn:aws:wafv2:us-east-1:257394494478:global/webacl/cds-superset-docs/5f4d283c-6fb5-46b0-ad96-6277e914b0a5" -> null
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_docs_errors will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_docs_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/cds-superset-docs"
      + name           = "error-superset-docs"
      + pattern        = "ERROR? Error? error?"

      + metric_transformation {
          + default_value = "0"
          + name          = "error-superset-docs"
          + namespace     = "superset-docs"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.superset_docs_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` errors logged over 1 minute."
      + alarm_name                            = "errors-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "error-superset-docs"
      + namespace                             = "superset-docs"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_docs_health_check will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_health_check" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` heath check has failed in a 2 minute period."
      + alarm_name                            = "health-check-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "HealthCheckId" = "5d446801-7f3d-4680-bd2e-273be959d5b3"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "HealthCheckStatus"
      + namespace                             = "AWS/Route53"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Minimum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_docs_invocation_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_invocation_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` invocation errors logged over 1 minute."
      + alarm_name                            = "invokcation-errors-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.superset_ecs_errors will be created
  + resource "aws_cloudwatch_query_definition" "superset_ecs_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/cds-superset-docs",
        ]
      + name                = "Superset Docs - errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /(?i)error/
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_ecr_lifecycle_policy.superset_docs will be destroyed
  # (because aws_ecr_lifecycle_policy.superset_docs is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "superset_docs" {
      - id          = "cds-superset-docs" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 30 release tagged images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber   = 30
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "v",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 10 git SHA tagged images"
                      - rulePriority = 10
                      - selection    = {
                          - countNumber   = 10
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "sha-",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Expire untagged images older than 7 days"
                      - rulePriority = 20
                      - selection    = {
                          - countNumber = 7
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "257394494478" -> null
      - repository  = "cds-superset-docs" -> null
    }

  # aws_wafv2_web_acl.superset_docs will be destroyed
  # (because aws_wafv2_web_acl.superset_docs is not in configuration)
  - resource "aws_wafv2_web_acl" "superset_docs" {
      - arn                         = "arn:aws:wafv2:us-east-1:257394494478:global/webacl/cds-superset-docs/5f4d283c-6fb5-46b0-ad96-6277e914b0a5" -> null
      - capacity                    = 930 -> null
      - description                 = "Superset Docs CloudFront distribution" -> null
      - id                          = "5f4d283c-6fb5-46b0-ad96-6277e914b0a5" -> null
      - lock_token                  = "1277a604-799f-4acb-94d0-def7b01e8c4a" -> null
      - name                        = "cds-superset-docs" -> null
      - scope                       = "CLOUDFRONT" -> null
      - tags                        = {
          - "CostCentre" = "cds-superset-docs-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "cds-superset-docs-staging"
          - "Terraform"  = "true"
        } -> null
        # (1 unchanged attribute hidden)

      - default_action {
          - allow {
            }
        }

      - rule {
          - name     = "RateLimit" -> null
          - priority = 40 -> null

          - action {
              - block {
                  - custom_response {
                      - response_code            = 429 -> null
                        # (1 unchanged attribute hidden)

                      - response_header {
                          - name  = "waf-block" -> null
                          - value = "RateLimit" -> null
                        }
                    }
                }
            }

          - statement {
              - rate_based_statement {
                  - aggregate_key_type    = "IP" -> null
                  - evaluation_window_sec = 300 -> null
                  - limit                 = 1000 -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "RateLimit" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "BlockLargeRequests" -> null
          - priority = 1 -> null

          - action {
              - block {
                }
            }

          - statement {
              - or_statement {
                  - statement {
                      - size_constraint_statement {
                          - comparison_operator = "GT" -> null
                          - size                = 8192 -> null

                          - field_to_match {
                              - body {
                                  - oversize_handling = "MATCH" -> null
                                }
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                  - statement {
                      - size_constraint_statement {
                          - comparison_operator = "GT" -> null
                          - size                = 8192 -> null

                          - field_to_match {
                              - cookies {
                                  - match_scope       = "ALL" -> null
                                  - oversize_handling = "MATCH" -> null

                                  - match_pattern {
                                      - excluded_cookies = [] -> null
                                      - included_cookies = [] -> null

                                      - all {}
                                    }
                                }
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                  - statement {
                      - size_constraint_statement {
                          - comparison_operator = "GT" -> null
                          - size                = 8192 -> null

                          - field_to_match {
                              - headers {
                                  - match_scope       = "ALL" -> null
                                  - oversize_handling = "MATCH" -> null

                                  - match_pattern {
                                      - excluded_headers = [] -> null
                                      - included_headers = [] -> null

                                      - all {}
                                    }
                                }
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "BlockLargeRequests" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 30 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRuleSet" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesCommonRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 20 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }

      - visibility_config {
          - cloudwatch_metrics_enabled = true -> null
          - metric_name                = "cds-superset-docs" -> null
          - sampled_requests_enabled   = false -> null
        }
    }

Plan: 5 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.superset_docs_errors"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
